cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСпособыРасчетаПоНаправлениям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьЗаПолныйМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСоциальногоНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоЧасам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗнаменательЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСпособРасчетаНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСпособРасчетаНорматива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗначениеПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКомнат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПроживающих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПрописанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧеловек</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргСпособыРасчетаПоНаправлениям(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
	УправлениеДоступностью();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРасчетаНормативаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура НормативПоДнямПриИзменении(Элемент)
	Если НЕ Запись.НормативПоДням Тогда 
		Запись.НормативПоЧасам = Ложь;
	КонецЕсли;
	
	УправлениеДоступностью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСвойствамиЭлементовФормы

&НаКлиенте
Процедура УправлениеВидимостью()	
	//Элементы.ВидПлощади.Видимость = НЕ Запись.СпособРасчетаНорматива = ПредопределенноеЗначение("Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади");	
	ЗначениеСвойства = НЕ Запись.СпособРасчетаНорматива = ПредопределенноеЗначение("Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади");	 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидПлощади", "Видимость", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()	
	ЗначениеСвойства = Запись.НормативПоДням;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НормативПоЧасам", "Доступность", ЗначениеСвойства);
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти
